{
  "title": "혼혈의 불꽃",
  "nodes": [
    {
      "id": "start",
      "name": "시작",
      "type": "text",
      "content": "",
      "x": 200,
      "y": 120,
      "next": "node_1749366716142_5874"
    },
    {
      "id": "node_1749366716142_5874",
      "name": "# 01 전장의 그림자",
      "type": "text",
      "content": "하늘이 검붉은 핏빛으로 물들었다. 불타오르는 들판 위에서 피와 쇠의 냄새가 진동했다. 전장 한가운데, 날카로운 비명과 절규, 죽어가는 자들의 신음이 뒤섞였다.\n\n\"후퇴는 없다! 마왕님을 위하여!\"\n\n사령관 마물의 거친 목소리가 전장을 메웠다. 그 가운데, 검은 갑옷을 입은 마물 하나가 서 있었다. 그의 이름은 '카이렌'. 하층 출신으로 마력조차 제대로 다루지 못하던 그였지만, 전장에서의 잔혹함과 냉철한 판단력 덕분에 전투의 선봉에 서 있었다.\n\n그러나 이번 전투는 달랐다.\n\n인간 군대가 준비한 함정이었다. 마법으로 무장한 인간 병사들이 사방에서 나타나 카이렌의 부대를 포위했다. 그는 즉시 검을 뽑아 들고 싸우기 시작했으나, 수적 열세는 극복할 수 없었다.\n\n'이대로 끝인가?'\n\n불타는 화살이 어깨를 스쳐 지나갔다. 고통이 전신을 찔렀지만, 그는 이를 악물고 버텼다.\n\n\"끝까지 싸워라! 한 명이라도 더 인간을 쓰러뜨려라!\"\n\n그러나 병사들은 하나둘 쓰러져 갔다.\n",
      "x": 500,
      "y": 120,
      "next": "node_1749366760886_8762"
    },
    {
      "id": "node_1749366760886_8762",
      "name": "# 02 절망의 끝에서",
      "type": "text",
      "content": "혼돈 속에서 인간 병사의 마법 화살이 그의 가슴에 깊숙이 박혔다. 숨이 턱 막히는 고통에 그는 무릎을 꿇었다.\n\n'이대로 죽을 수는 없다.'\n\n그는 필사적으로 전장을 벗어나려 애썼다. 흔들리는 시야와 흐릿해진 의식으로 간신히 전장을 빠져나와 울창한 숲 가장자리까지 도달했다.\n\n어둠 속 깊숙이 몸을 숨긴 채, 그는 마지막 힘을 짜내며 쓰러졌다. 눈꺼풀이 무겁게 내려앉았고, 의식은 점점 흐려졌다.\n\n'여기서 끝인가...'\n\n작은 속삭임만 남기고, 카이렌의 의식은 깊은 어둠 속으로 빠져들었다.\n",
      "x": 843,
      "y": 118,
      "next": "node_1749366787150_1415"
    },
    {
      "id": "node_1749366787150_1415",
      "name": "# 03 낯선 구원",
      "type": "text",
      "content": "카이렌이 눈을 떴을 때, 천장에는 나무 틈 사이로 새어나오는 은은한 등불빛이 일렁이고 있었다. 퀴퀴한 풀 냄새와 따뜻한 장작 불 냄새가 코끝을 스쳤다.\n\n몸을 일으키려다, 옆구리와 가슴에서 찢어질 듯한 통증이 밀려왔다. 그는 으윽 하는 신음을 내며 이불을 젖혔다. 그 순간, 어둠 속에서 조심스레 다가오는 발자국 소리.\n\n“괜찮아요? 움직이지 마세요.”\n\n놀란 듯 숨을 죽인 여성의 목소리가 들렸다. 한 손엔 찻잔, 다른 손엔 붕대가 들려 있었다.\n\n카이렌은 긴장하며 주위를 둘러보았다. 작은 오두막 내부였다. 그는 혼란스러운 마음으로 상황을 판단하려 애썼다.\n\n카이렌은 본능적으로 뒤로 물러났다. 등불 너머로 드러난 그녀의 얼굴 — 인간이었다.\n\n\"너는... 인간이냐?\" 그의 목소리는 쉰듯 낮게 깔렸다.\n\n그녀는 고개를 끄덕이며, 천천히 찻잔을 내려놓았다. “맞아요. 하지만 당신을 해치려는 건 아니에요. 상처가 너무 깊었어요. 이대로 두면 죽을 것 같아서…”\n\n카이렌은 눈을 가늘게 떴다. 의심과 혼란이 동시에 머리를 스쳤다. 자신은 마물이다. 인간의 적이다. 그런 자신을 살려둔 이유는…?\n\n“왜… 구했지?”\n\n그의 말엔 적의가 실려 있었고, 손가락은 베개 밑에 감춰진 단검을 향하고 있었다.\n\n그녀는 잠시 눈을 내리깔았다가, 작게 웃으며 말했다.\n“그냥... 사람이 죽어가는 걸 두고만 볼 수 없었어요. 당신이 마물이든, 인간이든…”\n\n그 대답은 오히려 카이렌을 더 혼란스럽게 만들었다. 그는 그 말을 믿어야 할지, 아니면 이 모든 것이 덫일지 판단할 수 없었다.",
      "x": 1211,
      "y": 126,
      "next": "node_1749366917295_3431"
    },
    {
      "id": "node_1749366917295_3431",
      "name": "선택 1",
      "type": "choice",
      "content": "",
      "x": 173,
      "y": 416,
      "next": "",
      "choices": [
        {
          "text": "그녀의 말에 미묘한 진심이 느껴진다. 칼을 놓고 조용히 그녀를 바라본다.",
          "next": "node_1749367094060_1054"
        },
        {
          "text": "그녀의 말이 거짓으로 들린다. 단검을 집어 위협하며 정체를 묻는다.",
          "next": "node_1749367112917_4847"
        }
      ]
    },
    {
      "id": "node_1749367094060_1054",
      "name": "선택 1-1",
      "type": "text",
      "content": "카이렌은 눈을 감았다가 뜨며 단검에서 손을 뗐다. 아직 의심은 남았지만, 그 안에 작은 호기심이 싹텄다.",
      "x": 557,
      "y": 358,
      "next": "node_1749367231839_3479"
    },
    {
      "id": "node_1749367112917_4847",
      "name": "선택 1-2",
      "type": "text",
      "content": "“속이려 들지 마라.” 카이렌은 단검을 들이대며 물었다. 그녀는 두려움에 떨었지만 눈은 흔들리지 않았다. “당신을 도운 건… 그냥 인간적인 일이었어요.”",
      "x": 556,
      "y": 573,
      "next": "node_1749367231839_3479"
    },
    {
      "id": "node_1749367231839_3479",
      "name": "# 04 불신 속의 나날과 사냥의 위기",
      "type": "text",
      "content": "오두막에는 여자의 아버지와 둘이서 지내는 흔적이 고스란히 남아 있었다.\n\n며칠간 회복하는 동안, 여자는 카이렌을 오두막 밖으로 데리고 나가 식물과 동물들을 하나씩 소개했다. 닭장 안에 알을 품은 암탉, 언덕 아래 작은 밭에서 자라고 있는 감자와 무, 그리고 장작더미 옆에서 몸을 웅크린 작은 염소들. 그녀는 이름도 붙여주고, 상태를 확인하며 다정하게 다루었다.\n\n\"얘는 루시예요. 이번엔 알을 다섯 개나 낳았어요. 이건 로타, 가장 고집 센 염소죠.\"\n\n카이렌은 그녀가 전혀 경계심 없이 동물들을 어루만지는 모습을 말없이 지켜보았다. 전쟁터에서는 살아남기 위해 칼을 들었고, 의심 없이 죽여야 했다. 그런데 이곳은, 누군가의 손길로 살아 숨 쉬는 생명들이 존재하고 있었다.\n\n'이런 걸… 왜 지키려는 거지?'\n\n그는 잠시 혼란에 빠졌다. 자신이 싸워온 이유와, 이들이 지켜온 일상이 너무 달랐다.\n\n두 사람은 근처 밭을 일구고 가축을 키우며 살고 있었다. 여자도, 그녀의 아버지도 경계심은 있었지만 카이렌에게 손길을 아끼지 않았다.\n\n며칠이 지나자 카이렌은 어깨의 통증이 줄어들고, 맥박이 차츰 정상을 되찾았다. 그러나 그는 여전히 머물 자격이 있는지 갈등했다. 적을 살려준 인간, 그리고 그 인간을 지켜보기만 해야 하는 자신. 몸은 회복되고 있었지만, 마음은 갈피를 잡지 못했다.\n\n어느 날, 여자가 말했다.\n\"사냥을 도와주실 수 있을까요? 오늘은 고기 구할 차례거든요.\"\n\n카이렌은 잠시 말없이 그녀를 바라보았다가 고개를 끄덕였다.\n\n숲속은 어둡고 축축했다. 둘은 조용히 걸었다. 여자의 손에는 짧은 창이, 카이렌의 손에는 아직 무거운 검이 들려 있었다. 여자는 익숙한 듯 발자국과 흔적을 살폈고, 카이렌은 조용히 주변을 경계했다.\n\n그때였다. 덤불 뒤에서 무언가가 튀어나왔다.\n\n'어둠의 발톱'이라 불리는 숲의 포식자였다. 온몸이 검은 비늘로 덮인 이 짐승은 독성이 있는 송곳니를 지니고 있으며, 마법적 성질의 피를 가지고 있어 회복제의 재료로 쓰이는 희귀한 존재였다.\n\n여자가 비명을 지르기도 전에, 짐승은 날렵하게 그녀를 향해 돌진했다. 카이렌은 검을 움켜쥔 손에 힘을 주었다. 본능은 싸우라고 외쳤지만, 머리는 갈등했다.",
      "x": 934,
      "y": 480,
      "next": "node_1749368100771_9149"
    },
    {
      "id": "node_1749368100771_9149",
      "name": "선택 2",
      "type": "choice",
      "content": "",
      "x": 186,
      "y": 860,
      "next": "",
      "choices": [
        {
          "text": "여자를 지키기 위해 몸을 던진다.",
          "next": "node_1749368108939_4009"
        },
        {
          "text": "거리를 두고 상황을 지켜본다.",
          "next": "node_1749368109586_2492"
        }
      ]
    },
    {
      "id": "node_1749368108939_4009",
      "name": "선택 2-1",
      "type": "text",
      "content": "여자가 비명을 지르기도 전에, 어둠의 발톱은 바람을 가르며 그녀를 향해 날아들었다. 검은 그림자가 번개처럼 움직였고, 여자의 손에 든 짧은 창은 그에겐 아무런 위협이 되지 못했다.\n\n카이렌은 망설였다. 살려야 하나, 아니면...\n하지만 그의 몸은 머리보다 먼저 움직였다.\n\n“뒤로 물러서!”\n그는 포효하며 몸을 던졌고, 발톱이 팔을 찢어 놓았다. 살점이 날아가고 피가 튀었다. 하지만 그는 그 고통을 무시한 채 짐승의 옆구리에 검을 꽂아 넣었다.\n\n“키아아아아아악!”\n\n어둠의 발톱이 날카로운 비명을 지르며 몸부림쳤다. 거대한 체구에 눌려 카이렌의 호흡이 끊겼지만, 그는 이를 악물고 검을 비틀었다.\n\n뒤에서 여자가 울부짖듯 소리쳤다.\n“카이렌!!”\n\n그녀는 다가서려 했으나, 짐승의 발이 허공을 휘저으며 그녀를 위협했다.\n\n카이렌은 마지막 힘을 다해 짐승의 목덜미를 찍어 내리쳤다. 피가 솟구쳤고, 짐승은 허공을 휘저은 채 고꾸라졌다.\n\n여자는 주저앉듯 달려와 카이렌을 끌어안았다. 손은 그의 피에 젖었고, 목소리는 떨렸다.\n\"제발... 제발 정신 차려요...\"\n\n카이렌은 숨을 헐떡이며 그녀를 바라보았다. 짙은 안개 속에서, 인간의 눈이 이토록 따뜻하게 느껴진 것은 처음이었다.\n\n\"괜찮아요? 다친 데는요?\"\n\n카이렌은 말없이 고개를 끄덕였다. 그의 팔에서는 검붉은 피가 흐르고 있었다.\n\n여자는 재빨리 자신의 겉옷을 찢어 그의 상처를 감쌌다.\n\"도와줘서 고마워요. 아니었으면 정말 큰일 날 뻔했어요.\"\n\n카이렌은 고개를 돌려 그녀를 바라보았다. 처음으로 진심으로 느껴지는 따뜻한 감정이 스며들었다. 자신을 믿고 다가온 인간, 그리고 자신이 지켜낸 인간.\n\n그는 조용히 입을 열었다.\n\"너희 같은 인간도… 있는 건가.\"\n\n여자는 의아한 듯 그를 바라보다가, 말없이 미소지었다.",
      "x": 551,
      "y": 822,
      "next": "node_1749368235286_7317"
    },
    {
      "id": "node_1749368109586_2492",
      "name": "선택 2-2",
      "type": "text",
      "content": "카이렌은 검을 쥔 채 멈춰섰다. 눈앞에서 짐승이 여자를 향해 돌진하는 모습이 느리게 펼쳐졌다. 본능은 그를 앞으로 밀쳐냈지만, 머리는 그를 붙잡았다.\n\n그가 주춤한 그 찰나, 짐승의 발톱이 여자의 다리를 깊숙이 파고들었다.\n“아아아악!”\n\n피가 뿜어져 나왔다. 그녀는 비명을 지르며 쓰러졌고, 짧은 창은 손에서 멀리 날아갔다.\n\n“젠장…”\n\n카이렌은 결국 달려들었다. 하지만 이미 상황은 악화돼 있었다. 짐승은 그를 향해 방향을 틀며 날카로운 이빨을 드러냈다.\n\n거대한 몸체가 달려들고, 그는 간신히 몸을 굴려 옆으로 피했다. 발톱이 나무껍질을 찢으며 허공을 갈랐고, 카이렌은 반사적으로 검을 휘둘렀다.\n하지만 어둠의 발톱은 빠르고, 무자비했다.\n\n피 튀기는 격투. 팔이 찢기고, 허벅지가 긁혔다. 그는 괴성을 지르며 다시 일어섰고, 수풀 너머에 쓰러진 여자의 모습을 흘끗 보았다.\n\n‘살아 있어야 한다…’\n\n분노가 폭발했다. 그는 마지막 힘을 짜내 짐승의 턱 아래를 파고들었고, 검을 거세게 찔러 넣었다. 칼끝이 목을 꿰뚫고, 짐승이 사방으로 피를 뿜으며 휘청였다. 그 순간, 카이렌은 그 위에 올라타 검을 다시 내리쳤다.\n\"죽어…!\"\n\n세 번, 네 번. 그는 짐승이 움직이지 않을 때까지 찔러댔다.\n\n숨이 끊어질 듯 거칠게 몰아쉬며, 그는 피투성이 손으로 얼굴을 문질렀다.\n그제야 그는 그녀 쪽으로 달려갔다.\n\n여자는 정신을 잃은 듯 축 늘어져 있었고, 다리에서는 계속 피가 흐르고 있었다.\n\n카이렌은 무릎을 꿇었다. 손이 떨렸다.\n“이런… 젠장…”\n\n그는 단검을 꺼내어 옷을 찢어 부상 부위를 감쌌다. 손놀림은 익숙했지만 마음은 아니었다.\n\n그의 입에서 조용한 목소리가 흘러나왔다.\n“…미안하다.”\n\n왜 그런 말을 했는지 자신도 알 수 없었다. 입을 다문 채 그는 떨리는 눈으로 여자를 바라보았다.\n\n‘왜 사과한 거지… 나는… 그냥…’\n\n숲속의 공기가 차갑게 식었다. 카이렌은 여전히 검은 피에 젖은 손으로 그녀의 체온을 확인하고 있었다.",
      "x": 551,
      "y": 1036,
      "next": "node_1749368235286_7317"
    },
    {
      "id": "node_1749368235286_7317",
      "name": "# 04",
      "type": "text",
      "content": "오두막으로 돌아온 밤, 공기는 조용했지만 무겁게 가라앉아 있었다. 전투로 인해 피와 상처, 감정이 뒤엉킨 그들의 몸과 마음은 아직 가라앉지 않았다.\n\n카이렌은 부상 입은 여자를 눕히고, 자신의 팔을 붕대로 감싸며 숨을 고르기 시작했다. 여자의 상처는 깊지는 않았지만, 피로와 통증으로 몸이 지쳐 있었다.\n\n“살아있어서… 다행이에요.”\n그녀가 중얼이듯 말했다.\n\n카이렌은 대답하지 않았다. 자신의 선택이 옳았는지 확신할 수 없었기 때문이다.\n\n다음 날, 여자의 아버지가 짐승의 고기를 손질했고, 카이렌은 그 곁에서 뼈와 장기를 분리했다. 짐승의 간과 뿌리약초를 섞은 죽은 생각보다 향이 좋았고, 고아낸 피는 붉은 치료약으로 쓰였다.\n\n그날 밤, 둘은 함께 식사를 했다. 조용히, 나란히. 여자는 손에 든 국그릇을 들여다보다가 입을 열었다.\n\n“…이런 맛, 전쟁터에서는 상상도 못했어요.”\n\n“전쟁터에선, 맛이 아니라 생존이 먼저다.”\n\n카이렌은 천천히 국물을 떠올렸다. 그리고 문득, 그녀의 다리 쪽을 바라보았다.\n\n“그쪽은 괜찮나.”\n“당신 팔은요?”\n\n둘은 서로의 상처를 바라보다가, 동시에 웃었다. 잠시 후, 그녀가 붕대를 가져와 그의 팔을 감싸주었다. 손끝이 그의 피부에 닿자, 그는 무의식적으로 숨을 멈췄다.\n\n그녀도 그 기척을 느꼈는지 말없이 손을 멈추었다.\n\n여자는 불빛을 바라보며 조용히 입을 열었다.\n\n“...사실, 마물에게 도움받은 건 이번이 처음이 아니에요.”\n\n카이렌은 눈을 들어 그녀를 바라보았다.\n\n“예전에, 아직 열세 살쯤이었을 때… 에르디아 국경 근처 숲에서 길을 잃었어요. 그런데 적국의 정찰병 몇 명이 절 발견하고는… 끌고 가려 했죠.”\n\n그녀의 목소리는 점점 낮아졌다.\n\n“그 순간, 마물 하나가 나타났어요. 굉장히 날카로운 눈을 가진, 인간보다 더 조용한 존재였죠. 적군 병사들이 먼저 그를 공격했는데… 그는 아무 말 없이 싸우더니, 그들을 다 물리치고는… 저를 보고도 아무 말 없이 떠났어요.”\n\n카이렌의 눈빛이 미묘하게 흔들렸다.\n\n“살려주려고 한 건 아니었겠죠. 그저… 개입하고 싶지 않았거나, 적들이 먼저 공격했기 때문에 싸운 것뿐일 거예요. 하지만 그 덕분에… 난 도망칠 수 있었어요.”\n\n그녀는 작게 웃었다.\n\n“그래서인지, 마물에 대한 감정이 다른 사람들과 조금은 달랐던 것 같아요. 꼭 ‘적’이 아니어도 될지도 모른다고… 그렇게 생각했었죠.”\n\n카이렌은 아무 말 없이 고개를 돌렸다. 작은 불씨 하나가 심장 어딘가를 톡 건드렸다.",
      "x": 945,
      "y": 928,
      "next": "node_1749368294283_3552"
    },
    {
      "id": "node_1749368294283_3552",
      "name": "# 05 경계 너머",
      "type": "text",
      "content": "카이렌은 오두막 앞 숲길을 혼자 걷고 있었다. 풀잎 사이로 서늘한 안개가 흘렀고, 이른 아침의 공기는 싸늘했다. 머릿속이 복잡했다. 여전히 팔에는 붕대가 감겨 있었고, 가슴엔 멍처럼 남은 감정이 자리잡고 있었다.\n\n그는 그동안 자신이 본 것들을 떠올렸다. 불길 속의 전장, 주검 속에서 살아남기 위해 고동치던 심장, 그리고… 인간 여자와 함께 나눈 잔잔한 일상.\n\n그녀의 웃음소리. 치료하던 손길. 불빛 앞에서 말없이 건넨 따뜻한 국물.\n\n‘하지만 나는… 이곳에 속한 자가 아니지.’\n\n그는 어느새 오두막 뒤쪽 바위 언덕에 섰다. 저 멀리 남쪽으로 향한 숲은 마물의 세계와 이어지는 경계선이었다. 그곳으로 돌아가면, 그는 다시 ‘마왕의 병사’로, 명령과 증오 속의 존재로 되돌아갈 수 있었다.\n\n뒤에서 발소리가 들렸다.\n\n“떠나는 거예요?”\n\n그녀였다. 한 손에는 담요, 다른 손에는 다 익지 않은 붉은 사과 한 알이 들려 있었다.\n\n“난... 여기 있을 자격이 없다.”\n\n카이렌은 고개를 돌리지 않았다.\n\n“여기엔, 평화를 바라는 이들도 있어요. 당신이 생각하는 것보다 더 많을지도 몰라요.”\n\n그녀의 말에 그는 잠시 눈을 감았다.\n\n“내가 그걸 증명할 수 있을까?”\n\n“모든 변화는 한 사람으로부터 시작된대요.”\n\n그녀는 사과를 내밀며 덧붙였다.\n“길 떠나기 전엔 뭔가 먹는 게 좋잖아요.”\n\n카이렌은 그 사과를 받아들고, 아무 말 없이 씹었다. 달지도 쓰지도 않은 맛. 하지만 묘하게 마음을 진정시키는 감촉이었다.",
      "x": 1327,
      "y": 926,
      "next": "node_1749368311254_9765"
    },
    {
      "id": "node_1749368311254_9765",
      "name": "선택 3",
      "type": "choice",
      "content": "",
      "x": 138,
      "y": 1459,
      "next": "",
      "choices": [
        {
          "text": "마물 사회로 돌아가기로 결심한다.",
          "next": "node_1749368333363_4358"
        },
        {
          "text": "좀 더 머물며 인간과의 시간을 더 지켜보기로 한다.",
          "next": "node_1749368345134_9409"
        }
      ]
    },
    {
      "id": "node_1749368333363_4358",
      "name": "선택 3-1",
      "type": "text",
      "content": "카이렌은 사과를 먹고, 짧게 고개를 끄덕였다. “내가 누군지 확인할 필요가 있다.” 그는 오두막을 떠나 숲을 향해 걸었다. 그 등을 바라보는 그녀의 눈엔, 말하지 못한 말이 맴돌고 있었다.",
      "x": 534,
      "y": 1356.7999877929688,
      "next": "node_1749368375888_489"
    },
    {
      "id": "node_1749368345134_9409",
      "name": "선택 3-2",
      "type": "text",
      "content": "카이렌은 사과를 내려다보다가, 작게 한숨을 내쉬었다. “조금만 더… 여기 있고 싶다.” 그녀는 고개를 끄덕이며 담요를 그의 어깨에 걸쳐주었다. 바람이 불었고, 두 사람 사이엔 잠시나마 조용한 평화가 감돌았다.",
      "x": 532,
      "y": 1652.7999877929688,
      "next": ""
    },
    {
      "id": "node_1749368375888_489",
      "name": "# 06 불꽃 속의 진실(마물 사회 루트)",
      "type": "text",
      "content": "마물 사회로 돌아온 카이렌은 마왕 측의 감시 아래 다시 임무를 맡게 되었다. 겉으로는 충직한 병사처럼 보였지만, 그의 내면에는 균열이 일어나고 있었다. 인간 여자와의 시간, 평화로운 일상, 사과라는 말… 그 모든 것이 그를 이전과는 다른 존재로 만들고 있었다.\n\n그는 얼마 전 들었던 이상한 소문을 떠올렸다. 어떤 마물들이 인간 포로를 풀어주고 있다는 이야기. 누군가 감시당하지 않는 곳에서 인간과 은밀히 접촉하고 있다는 정보.\n\n그는 조사에 착수했다. 밤마다 순찰을 빌미로 마을 외곽을 돌았고, 기묘하게 조용한 동굴 입구에서 이상한 흔적을 발견했다. 마법으로 봉인된 문, 묘하게 따뜻한 기운, 그리고 인간의 말이 섞인 속삭임.\n\n며칠간 관찰하던 끝에, 그는 결정했다.\n\n‘직접 들어간다.’\n\n카이렌은 몰래 봉인을 해제하고 내부로 잠입했다. 그러나 생각보다 빠르게 정체를 들켰다. 등을 치는 무언가의 충격과 함께 정신이 아득해졌다.\n\n...\n\n눈을 떴을 때, 카이렌은 마력으로 봉인된 원 안에 있었다. 주변은 고요하고 어두웠다. 마물 특유의 언어가 들려왔다.\n\n“생각보다 빠르군. 감시받는 자가 감시자가 되다니.”\n\n그의 앞에 한 마물이 모습을 드러냈다. 인간형, 그러나 눈빛은 짐승보다 더 맹렬했다. 그 뒤로 몇 명의 마물들이 조용히 그를 둘러싸고 있었다.\n\n“‘혼혈의 불꽃’의 영역에 발을 들인 이유를 말해라. 아니면… 기억을 없애고 내보낼 수도 있다.”\n\n카이렌은 숨을 고르며 침묵했다. 그들 눈에는 지금 그가 적인지, 동지인지 불분명했다.",
      "x": 928,
      "y": 1349.7999877929688,
      "next": "node_1749368435655_1497"
    },
    {
      "id": "node_1749368435655_1497",
      "name": "# 06",
      "type": "text",
      "content": "그는 숨을 내쉬며 말했다. “난… 너희가 인간과 함께 움직인다는 걸 직접 보고 싶었어. 믿고 싶었고… 이해하고 싶었다.” 마물들은 웅성였고, 리더격 인물이 고개를 끄덕였다. “그렇다면, 우리와 대화를 나눠보자.”",
      "x": 1293,
      "y": 1349.7999877929688,
      "next": "node_1749368455427_6023"
    },
    {
      "id": "node_1749368455427_6023",
      "name": "# 07 동요하는 이상(마물 사회 루트)",
      "type": "text",
      "content": "불길한 봉인의 기운이 걷히자, 카이렌은 작지만 깊숙한 동굴 내부로 이끌렸다. 그곳은 겉보기엔 어둡고 음습했지만, 내부는 인간과 마물이 함께 만든 듯한 구조였다. 돌벽에는 고대 문자와 인간어가 섞여 쓰인 문장이 새겨져 있었다.\n\n“다른 언어로 말해도, 고통은 같다.”\n\n카이렌은 천천히 주변을 둘러보았다. 그를 안내한 마물은 낮은 목소리로 말했다.\n\n“여긴 진실을 숨기기 위해 존재하는 곳이 아니다. 우리 '혼혈의 불꽃'은 인간과 마물의 공존을 믿는다. 허상이 아닌, 실재로.”\n\n그의 앞에 한 무리의 마물과 인간이 모습을 드러냈다. 대부분은 인간형 마물 혹은 혼혈이었고, 몇몇은 인간 병사 출신이었다.\n\n“저 녀석이 그 자냐?”\n\n목소리를 높인 건 검은 피부의 늙은 마물이었다. 눈빛이 날카로웠다.\n\n“마왕의 부대였다고?”\n\n다른 마물이 중얼였다. “그의 손에 죽은 동료가 있을지도 모른다.”\n\n카이렌은 이질적인 시선을 견디며 중심에 섰다.\n\n“그렇다. 나는 마왕의 부대 소속이었다. 지금도 그 이름 아래에 명령을 따르고 있다.”\n\n순간, 몇몇 마물이 몸을 움찔했지만, 그는 말을 이었다.\n\n“하지만 그 명령이 언제부터 ‘살육’으로만 가득했는지… 내가 어디서부터 틀어졌는지… 그걸 알고 싶어졌다.”\n\n조용하던 공간에 목소리가 울렸다. 이번엔 여성 혼혈 마물이 입을 열었다.\n\n“우리도 실수하고, 분노하고, 방황한다. 하지만 그 끝에 평화를 원한다면… 함께 갈 수 있겠지.”\n\n그녀는 손을 내밀었다.\n\n카이렌은 그 손을 바라보며 천천히 입을 열었다.\n\n“…믿는다고 말하긴 어렵다. 하지만, 보고 싶긴 하다. 끝까지.”",
      "x": 1643,
      "y": 1352.7999877929688,
      "next": "node_1749368470906_8545"
    },
    {
      "id": "node_1749368470906_8545",
      "name": "# 08 불안한 사절",
      "type": "text",
      "content": "밤이 되자, 동굴 내부는 고요해졌다. 마력으로 불이 켜진 작은 홀에서 카이렌은 조직의 리더와 마주 앉아 있었다. 그의 앞에 봉인된 봉투 하나가 놓였다.\n\n“이건 에르디아 왕국의 중립 마을 ‘켈바’에 사는 인간 연계자에게 전해야 한다. 내용은 열어보지 마라. 위치는 여기에 있다.”\n\n리더는 손가락으로 마법지도를 펼쳤다. 지도에는 평야를 가로지르는 길 하나와, 인간과 마물의 경계지대에서 간신히 유지되고 있는 작은 마을이 표시되어 있었다.\n\n“단순한 전달이지만… 인간이 널 보면 적이라 생각할 수도 있다. 조심해라. 우리와 연결된 이조차도, 항상 안전하지는 않다.”\n\n카이렌은 고개를 끄덕이고 봉투를 품에 넣었다.\n\n“언제 출발하지?”\n\n“지금. 새벽 전에 도착하지 않으면, 다음 연락까지 기회가 없다.”\n\n...\n\n달빛이 어슴푸레한 들판을 혼자 걷는 길은 오래된 전장의 잔향을 떠올리게 했다. 그의 눈에는 불탔던 마을과 쓰러진 동료들, 그리고 인간 병사들의 죽어가는 눈빛이 겹쳐졌다.\n\n'내가 지금... 누구를 위해 움직이고 있는 거지?'\n\n숲을 지나던 중, 수풀 너머에서 인기척이 났다. 카이렌은 반사적으로 검을 뽑았다.\n\n“누구지.”\n\n짧은 정적 후, 어린 목소리가 들렸다.\n\n“...움직이지 마세요.”\n\n수풀에서 나온 건, 어린 인간 병사였다. 기척을 감추려 애썼지만, 손의 떨림은 숨길 수 없었다. 그의 뒤엔 또 다른 병사 한 명이 있었다.\n\n“네가… 마물이냐?”\n\n병사의 말에 카이렌은 검을 낮추지 않은 채 대답했다.\n\n“너희를 죽이러 온 건 아니다.”\n\n“거짓말 마!”\n\n병사가 마법구슬을 꺼내 들었다. 그 순간 카이렌은 땅을 굴러 회피하고, 정면 돌파 대신 숲을 이용해 우회로를 선택한다. 인간 병사들과 충돌을 피한 채 결국 목적지에 도달한다.",
      "x": 1997,
      "y": 1353.7999877929688,
      "next": "node_1749368667431_740"
    },
    {
      "id": "node_1749368667431_740",
      "name": "# 09 경계의 마을",
      "type": "text",
      "content": "새벽녘, 켈바 마을은 안개에 잠긴 듯 조용했다. 흙담집과 낮은 울타리, 그리고 어딘가 낯선 긴장감이 마을을 감싸고 있었다.\n\n카이렌은 외곽의 외양간 근처에서 말을 먹이고 있던 노인을 발견했다. 그는 카이렌을 힐끗 쳐다보다가, 얼굴을 찌푸렸다.\n\n“여기, 낯선 얼굴이군. 무기 좀 보여주지 않겠나.”\n\n카이렌은 천천히 검을 내려놓고 손을 들었다.\n\n“나는... 누군가를 만나러 왔다. 이걸 전하라고 했다.”\n\n그는 봉투를 꺼내 노인에게 보여줬다. 노인은 봉투를 유심히 바라보더니, 얼굴이 단단해졌다.\n\n“따라와.”\n\n...\n\n그는 마을 한가운데 있는 조그만 숲집으로 안내되었다. 안에는 은색 머리를 가진 중년 여성과, 팔에 붕대를 감은 젊은 남자가 있었다. 여자는 카이렌을 보고도 놀라지 않았다.\n\n“혼혈의 불꽃에서 왔나 보군요. 더 늦었으면 위험할 뻔했어요.”\n\n카이렌은 봉투를 건넸고, 여자는 봉인을 풀며 그 내용을 확인했다. 얼굴엔 긴장과 안도감이 동시에 스쳤다.\n\n“좋아요. 마왕 측이 이쪽에 관심을 두기 시작했어요. 정보가 퍼지기 전에 움직일 수 있게 되었군요.”\n\n카이렌은 고개를 끄덕였지만, 방 안의 공기에는 여전히 묘한 경계가 감돌고 있었다.\n\n그때 젊은 남자가 말했다.\n\n“넌… 마물이잖아. 우린 네가 협상자가 맞는지, 아니면 첩자인지도 모른다.”\n\n카이렌은 말없이 그를 바라보았다.\n\n“혹시, 오는 길에 병사들과 마주쳤어?”\n\n카이렌은 잠시 침묵하다가 대답했다.\n\n젊은 남자는 고개를 끄덕이며 말을 이었다. “그렇다면 다음 연락도 부탁할 수 있겠군. 넌, 믿을 만한 놈일지도 모르겠어.” 방 안의 긴장이 조금 누그러졌다.",
      "x": 2343,
      "y": 1350.7999877929688,
      "next": "node_1749368811205_3332"
    },
    {
      "id": "node_1749368811205_3332",
      "name": "# 10 의심의 불씨",
      "type": "text",
      "content": "켈바에서의 임무를 마친 후, 카이렌은 늦은 밤 다시 혼혈의 불꽃 본부로 돌아왔다. 조직의 리더는 그를 반겼지만, 동시에 걱정 섞인 눈빛을 감추지 않았다.\n\n“잘했다. 하지만 이제부터는 더 조심해야 할 거다.”\n\n“켈바의 인간들은 아직 우릴 완전히 믿지 못해. 마왕 쪽 간부들이 이 지역에 시선을 두고 있어.”\n\n카이렌은 고개를 끄덕였지만, 돌아오는 길 내내 느꼈던 누군가의 ‘기척’이 머릿속을 떠나지 않았다. 누군가가 분명 그를 지켜보고 있었다. 그것도, 매우 가까운 거리에서.\n\n...\n\n며칠 후.\n\n카이렌은 조직의 부름을 받아, 리더와 고위 간부 몇 명과 함께 향후 작전 회의에 참여했다. 그러나 회의가 끝난 뒤, 리더는 조용히 그를 따로 불렀다.\n\n“너, 최근 마왕 측 정보관리국 쪽에서 네 이름이 오르내리고 있는 것 알고 있나?”\n\n“...어떻게?”\n\n“니가 켈바 근처를 돌아다녔을 때, 마왕 간부 ‘자르테’가 마침 그 지역을 순찰 중이었다더군. 니 마력을 감지했다고 보고를 했대.”\n\n카이렌은 눈을 가늘게 떴다.\n\n‘...기척. 역시 그 자였나.’\n\n리더는 잠시 침묵하다가 중대한 말투로 덧붙였다.\n\n“조만간 ‘자르테’가 직접 너를 부르거나, 이곳으로 찾아올 수도 있다. 그가 널 시험하거나, 심문할 수도 있겠지.”\n\n“그래서…?”\n\n“그가 널 직접 시험하려 들면, 피할 수 없는 충돌이 생길 수도 있다. 그건 우리가 감당할 수 없는 일이야.”\n\n카이렌은 말없이 천장을 바라보았다. 전장의 피 냄새보다 더 진한 정치의 냄새. 그는 점점 진흙 속으로 들어가는 기분이었다.\n\n“도망치지 않겠다. 정면으로 부딪치자.” 리더는 그를 바라보다 작게 웃었다. “그 답변, 네가 ‘진짜’인 걸 보여주길 바란다.”",
      "x": 1296,
      "y": 1661.7999877929688,
      "next": "node_1749368850958_1839"
    },
    {
      "id": "node_1749368850958_1839",
      "name": "# 11 검은 낙인",
      "type": "text",
      "content": "그날 밤, 혼혈의 불꽃 본부 외곽 숲에 낯선 기운이 깃들었다. 주변의 공기마저 가라앉은 듯, 동굴 근처 짐승들이 기척을 숨겼다.\n\n카이렌은 그 기척이 익숙하다는 걸 알았다. 짙은 마력, 차가운 살기, 그리고 무언의 판단.\n\n‘...자르테.’\n\n그가 숲 밖에 나서자, 이미 그 자가 기다리고 있었다.\n\n자르테는 검은 외투를 휘날리며 바위에 기대 서 있었다. 눈빛은 무표정했지만, 그 깊은 곳엔 오래된 피냄새가 스며 있었다.\n\n“오랜만이다, 카이렌. 아니, 아니지. 이제는... 마물과 인간 사이의 균열을 기웃거리는 배신자라고 불러야 하나?”\n\n카이렌은 말없이 검집을 쥐었다.\n\n“이상하군. 전엔 그렇게 충직한 놈이었는데. 인간에게 구해졌단 소문이 사실이더군. 그 암컷 하나 때문에 눈이 멀었나?”\n\n카이렌의 눈썹이 살짝 떨렸다.\n\n자르테는 걸음을 옮겼다. 그의 뒤엔 검은 무장이 흔들리고, 발 아래 흙이 눌려갔다.\n\n“마왕께서 네 이름을 다시 언급하셨다. 감시 목록에서 삭제되지 않은 자는... 언젠가 정리되어야 하지.”\n\n카이렌은 그 말에 정면을 응시했다.\n\n“그래서? 네가 정리하러 왔나?”\n\n자르테는 피식 웃으며, 허리에 찬 검의 손잡이를 두드렸다.\n\n“아니. 지금은 아니다. 그럴 필요도 없다. 넌 이미 스스로 무너지기 시작했으니까.”\n\n그 말은 칼보다 날카로웠다. 카이렌은 한 걸음 앞으로 나섰다.\n\n“내가 무너진다면... 네가 생각하는 방향으로는 아니야.”\n\n자르테의 표정이 잠시 굳었다.\n\n“흥미롭군. 다음번엔 말이 아니라 검으로 대화하게 될 거다, 카이렌.”\n\n자르테는 한순간에 그림자처럼 사라졌다. 그의 마력이 걷히자, 숲의 공기가 다시 숨을 쉬기 시작했다.\n\n카이렌은 자리를 지킨 채 가만히 서 있었다. 손은 여전히 검집에서 힘을 풀지 않았다.",
      "x": 1647,
      "y": 1661.7999877929688,
      "next": "node_1749369007528_8638"
    },
    {
      "id": "node_1749369007528_8638",
      "name": "# 12 다시 만난 불꽃",
      "type": "text",
      "content": "혼혈의 불꽃 본부 회의실, 이른 새벽.\n\n리더가 펼쳐든 고서 위에 얇고 단단한 봉투 하나가 놓였다. 마법 봉인이 걸린 문서였다.\n\n“이건 마르그 제국 내 중립 구역에 위치한 ‘레사르 요새’에 있는 연락책에게 전달될 문서다. 조직의 다음 단계 계획과 관련된 핵심 정보가 포함돼 있다.”\n\n카이렌은 조용히 봉투를 집어 들었다. 차갑고 묵직한 기운이 손끝을 타고 흘렀다.\n\n“이번 임무는 단독이다. 요새 근처에서 네가 잘 아는 인간과 접촉하게 될 수도 있어.”\n\n그 말에 카이렌은 눈썹을 살짝 찌푸렸다.\n\n“그게... 누구지?”\n\n“그 여자 말이다. 너를 처음 구해준 인간. 그녀가 그 지역의 연락책과 관련돼 있다는 정보가 들어왔다.”\n\n그 이름조차 언급하지 않았지만, 카이렌은 바로 떠올렸다.\n짧지만 깊었던 나날. 손에 남아 있던 따뜻함. 그 미소.\n\n그는 아무 말 없이 고개를 끄덕였다.\n\n...\n\n레사르 요새 인근, 구름 낀 오후.\n\n카이렌은 검은 망토를 휘날리며 숲속 오솔길을 걸었다. 저 멀리, 성벽 사이로 작은 인형처럼 서 있는 인물이 보였다.\n\n그녀였다.\n\n조심스럽게, 천천히 걸음을 옮기던 그녀가 카이렌을 발견하고 눈을 크게 떴다. 손에 들고 있던 약초 바구니가 떨어졌고, 그녀는 그대로 달려왔다.\n\n“...카이렌!”\n\n그는 무의식적으로 한 발짝 앞으로 나아갔다. 그녀가 그를 껴안았다. 따뜻하고 부드러운 온기.\n\n“살아 있었구나…”\n\n그 말에 카이렌은 조용히 눈을 감았다. 잠시 잊고 있었던 감정들이, 다시 밀려들었다.\n\n“너는... 여기에 왜…”\n\n“우리 조직의 연락책과 함께 일하고 있어요. 저는 여기 사람들을 치료해주고, 정보를 교류하고 있었어요.”\n\n그녀는 진지한 눈빛으로 그를 바라보았다.\n\n“이젠... 당신도 같은 길에 있는 거죠?”\n\n카이렌은 잠시 말을 잃었다. 그 순간, 멀리서 금속이 긁히는 기척이 들렸다.\n\n숲 저편에서 익숙한 기운이 다가오고 있었다.\n\n‘...자르테.’\n\n카이렌은 그녀를 끌어당기며 바위 뒤로 몸을 숨겼다. 한쪽 손으론 그녀의 입을 막았다.\n\n그녀의 눈이 놀란 채 떨렸다. 하지만 곧 그의 진심을 읽고, 고개를 끄덕였다.\n\n...\n\n그림자처럼 다가온 자르테의 기척은 요새 외곽을 스치고 지나갔다. 그는 아직 둘의 존재를 눈치채지 못한 듯했지만, 오래 지나지 않아 무언가를 감지한 듯 발걸음을 멈췄다.\n\n카이렌은 숨을 죽이며 생각했다.\n\n‘이제 곧... 피할 수 없게 된다.’",
      "x": 1995,
      "y": 1660.7999877929688,
      "next": "node_1749369026426_1514"
    },
    {
      "id": "node_1749369026426_1514",
      "name": "# 13 그림자 속의 칼날",
      "type": "text",
      "content": "요새 외곽 숲, 해가 지기 시작한 하늘이 붉게 물들어가고 있었다.\n\n카이렌은 인간 여자를 바위 뒤에 조심스럽게 숨겨두고, 단검을 꺼내 검집에 감쌌다. 그의 눈은 이미 전장의 냄새를 읽고 있었다. 자르테가 가까워지고 있었다.\n\n그리고—그 순간, 들켰다.\n\n“카이렌.”\n\n자르테의 낮고 깊은 목소리가 숲을 가르며 울렸다. 그는 어둠처럼 미끄러지듯 나타났다. 주변 공기까지 얼어붙은 듯 무거웠다.\n\n“이런 외진 곳에서... 혼자?”\n\n카이렌은 천천히 일어섰다. 그는 말없이 자르테를 바라보았다.\n\n“아니군. 혼자는 아니야. 인간의 체취가 여기 있다. 바로 근처에.”\n\n자르테의 눈빛이 차갑게 반짝였다. 그는 한 걸음 다가왔다.\n\n“마왕께선 네가 어디까지 썩었는지 확인하라 하셨지. 그런데 이렇게 친절하게 본색을 보여주다니.”\n\n카이렌은 검을 반쯤 뽑았다. 한 손은 인간 여자 쪽을 막아서는 듯 뒤로 뻗었다.\n\n“그녀는... 이 전쟁의 적이 아니다.”\n\n“그럼 뭐지? 네 연인인가? 아니면 널 유혹한 독? 구역질나는 헛소리 그만하고, 네가 선택해라. 지금. 여기서.”\n\n자르테는 검을 천천히 뽑았다. 날이 어둠 속에서도 번뜩였다.\n\n“인간을 넘겨라. 아니면, 네 피로 대신해.”\n\n그 순간, 숲은 숨을 멈췄다. 두 마물 간의 살기가 공기를 찢고 있었다.\n\n바위 뒤에서, 인간 여자는 떨리는 숨을 억누르고 있었다. 그녀는 모든 걸 듣고 있었다.",
      "x": 2348,
      "y": 1655.7999877929688,
      "next": "node_1749369117482_8664"
    },
    {
      "id": "node_1749369117482_8664",
      "name": "# 14 불꽃의 검",
      "type": "text",
      "content": "“그럼, 결정된 거군.”\n\n자르테의 검이 빛을 삼키듯 어둠 속에 들려졌다. 그의 마력은 주변 공기를 짓눌렀고, 땅이 떨렸다.\n\n카이렌은 검을 완전히 뽑아들었다. 그 손엔 망설임이 없었다. 더 이상은 도망치지 않겠다는 결의만이 서려 있었다.\n\n“난 이제, 네 명령에 따르는 병사가 아니다.”\n\n“네가 나를 배신하는 순간, 그 더러운 인간 여자도 함께 죽는다.”\n\n“손대보시지. 오늘은... 내가 널 가르칠 차례니까.”\n\n자르테는 살짝 웃었다.\n\n“좋다. 그럼, 마왕을 향한 네 환상. 내가 산산조각 내주마.”\n\n그 순간, 두 마물의 마력이 폭발했다.\n\n⚔️ 쾅!\n\n첫 검이 부딪치자, 충격파가 숲을 갈랐다. 나무들이 쓰러지고, 바위가 깨졌다. 두 사람은 마치 무중력 속에서 날아오르듯 움직였고, 각자의 그림자가 땅에 번개처럼 새겨졌다.\n\n자르테는 정교하고 맹렬한 연속 베기로 압박해왔고, 카이렌은 틈을 비집고 반격을 이어갔다.\n\n숨이 끊어질 듯 격렬한 연타. 상처가 생기고, 피가 튀었다.\n\n“마왕은 널 용서하지 않을 것이다!”\n“난 그의 용서를 구하지 않는다!”\n\n자르테의 검이 어깨를 스쳤고, 카이렌의 반격이 복부를 찔렀다. 둘은 동시에 뒤로 물러났다.\n\n숨을 몰아쉬며, 카이렌은 생각했다.\n\n‘...지금까지의 내가, 이 한 순간에 전부 쏟아지고 있다.’\n\n그의 몸을 타고 불꽃처럼 마력이 일었다.\n\n‘여기서 이기지 못하면… 난 누구도 지키지 못한다.’",
      "x": 2720,
      "y": 1657,
      "next": "node_1749369137534_7590"
    },
    {
      "id": "node_1749369137534_7590",
      "name": "# 14",
      "type": "text",
      "content": "카이렌은 마지막 일격을 품에 실었다.\n검이 자르테의 가슴을 꿰뚫었고, 그 마력장이 깨지는 소리가 퍼졌다.\n\n자르테는 무릎을 꿇었다. 피를 토하며, 허탈하게 웃었다.\n\n“이런… 이기다니…”\n\n카이렌은 그를 바라보며 숨을 골랐다.\n\n“죽이진 않겠다. 아직… 너도 싸울 수 있어.”\n\n자르테는 눈을 가늘게 떴다.\n\n“...그 말, 마왕에게도 할 수 있겠나?”\n\n카이렌은 대답하지 않았다. 다만, 자신의 길이 확실해졌다는 눈빛만이 있었다.",
      "x": 3064,
      "y": 1660,
      "next": "node_1749369211805_6373"
    },
    {
      "id": "node_1749369211805_6373",
      "name": "# 15 꺼지지 않는 불씨",
      "type": "text",
      "content": "피로 얼룩진 검 끝을 거둬들이며, 카이렌은 천천히 자르테에게 다가갔다.\n\n“...죽이지 않을 거냐?”\n\n무릎을 꿇은 자르테의 목소리는 피와 함께 떨렸다. 그러나 그 눈은 여전히 거칠게 살아 있었다.\n\n카이렌은 대답 대신, 자신의 손을 뻗었다.\n\n“너도… 이 구조가 잘못됐다는 걸 알고 있을 거다.”\n\n자르테는 그 손을 한참 바라보다가 작게 웃었다.\n\n“넌 정말… 인간과 마물 사이에 끼인 불씨 같군. 어디에도 속하지 못한 채 타오르는.”\n\n“그래도, 나는… 이 불을 끄지 않을 거야.”\n\n카이렌의 눈빛은 더 이상 흔들리지 않았다.\n\n자르테는 느릿하게 손을 들어 그의 손을 잡았다. 상처투성이 두 손이 마주 닿는 순간, 서로의 마력이 짧게 공명했다. 그것은 증오가 아닌 이해의 신호였다.\n\n“...좋아. 한 번, 너 따위의 희망이라는 걸 믿어보지.”\n\n다음 날, 혼혈의 불꽃 본부.\n\n리더는 자르테를 보고 일순간 경계를 보였지만, 카이렌의 눈빛을 보고 말을 삼켰다.\n\n“그를 죽이지 않고 데려왔다?”\n\n“우리의 적이었던 자가, 지금은 가장 강력한 방패가 될 수도 있습니다.”\n\n자르테는 고개를 들고 말했다.\n\n“나, 자르테. 혼혈의 불꽃을 위해 싸울 것이다. 단, 이 길이 진짜 의미를 가질 수 있다면.”\n\n리더는 조용히 고개를 끄덕였다. 그들의 시선은 하나의 방향을 향하고 있었다.\n\n“...이제, 마지막으로 갈 때가 됐군.”",
      "x": 3418,
      "y": 1666,
      "next": "node_1749369232962_3301"
    },
    {
      "id": "node_1749369232962_3301",
      "name": "# 16 왕의 문 앞에서",
      "type": "text",
      "content": "붉은 해가 마물 대지의 하늘을 뚫고 내려왔다. 산맥을 넘는 순간, 모든 것이 고요해졌고, 냉기 속에서 거대한 검은 성의 실루엣이 떠올랐다.\n\n마왕성.\n\n카이렌과 자르테, 그리고 혼혈의 불꽃 조직의 정예들이 조용히 진군하고 있었다. 모두는 말없이 걷고 있었지만, 발걸음에는 각자의 무게와 결의가 서려 있었다.\n\n“여기부터는 돌아갈 수 없다,” 자르테가 말했다.\n“왕의 경계는 마력으로만 반응하지 않아. 마음의 흔들림조차 감지한다.”\n\n카이렌은 눈을 감았다. 머릿속엔 인간 여자와 나눈 마지막 대화가 떠올랐다.\n\n“당신이 끝까지 간다면… 저는 기다릴게요.”\n\n그 말이 심장에 남아, 두려움을 이겨내는 불꽃이 되었다.\n\n...\n\n성문 앞, 갑옷을 입은 마물 병사들이 모습을 드러냈다. 수적으로 불리했지만, 그들의 얼굴에는 혼란이 서려 있었다. 자르테가 앞으로 나섰다.\n\n“이들을 해치우는 게 목적이 아니다. 우리의 적은… ‘왕’ 그 자체다.”\n\n카이렌은 고개를 끄덕였다.\n\n“지금부터는 내가 간다. 마왕과는… 나 자신이 마주해야 하니까.”\n\n리더는 조용히 카이렌의 어깨를 잡았다.\n\n“이 싸움은, 네 사상이 옳았는지를 증명하는 마지막 시련이 될 거다. 어떤 결말이든, 네가 만든 길이야.”\n\n카이렌은 검을 뽑았다. 그날 인간 여자에게 처음 구해졌을 때와는 전혀 다른 손놀림이었다. 그 검은 더 이상 살육의 도구가 아니었다.\n\n성문이 열렸다.\n\n차가운 마력의 파동이 성 안에서 밀려나왔다.\n그리고, 마왕이 그들을 기다리고 있었다.",
      "x": 3780,
      "y": 1663,
      "next": "node_1749369252782_7538"
    },
    {
      "id": "node_1749369252782_7538",
      "name": "# 17 불꽃의 왕좌",
      "type": "text",
      "content": "마왕의 방은 붉은 수정으로 만들어진 기둥들로 둘러싸여 있었다. 검붉은 불꽃이 천장을 비추고 있었고, 중앙에는 검은 망토를 두른 거대한 존재—마왕이 앉아 있었다.\n\n“왔군, 배신자.”\n\n그의 목소리는 땅을 울렸다. 카이렌은 조용히 성전을 올리고 걸어 들어갔다.\n\n“나는 이제... 네가 명령하던 도구가 아니다.”\n\n마왕은 일어나 천천히 검을 뽑았다. 그 검 끝에는 수많은 마물들의 피와 인간의 절규가 묻어 있었다.\n\n“그래. 네가 어떤 길을 택했는지 보겠다. 그리고, 그 결과를 내가 심판하지.”\n\n마력이 일었다. 천장이 흔들렸다. 전장의 기억들이 검기 속에서 튀어나왔다.\n\n카이렌은 눈을 감고, 그 모든 환영을 받아들였다. 그리고—달려들었다.\n\n⚔️ 쾅! 쾅!\n\n검과 검이 부딪쳤다. 마왕은 육체적 강함뿐 아니라, 마력의 정수를 몸에 두른 존재였다. 그러나 카이렌은 단순한 힘이 아니라, 사람들과의 신뢰와 고통의 이해를 검에 실어 휘둘렀다.\n\n“이 검은, 단순한 복수가 아니다. 이건... 모두를 위한 싸움이다!”\n\n전투는 길었고, 치열했다. 마왕의 일격이 어깨를 갈랐고, 카이렌의 베기가 그의 가슴을 파고들었다.\n\n마지막 일격.\n\n카이렌은 전신의 힘을 모아 마왕의 가슴을 꿰뚫었다. 검은 피가 뿜어졌고, 마왕은 눈을 크게 떴다.\n\n“...인간과... 마물이... 함께라니... 어리석군... 하지만...”\n\n그는 웃으며 무너졌다.\n\n“그 어리석음이... 아주 잠깐... 부러웠다...”",
      "x": 4129,
      "y": 1662,
      "next": "node_1749369269529_8276"
    },
    {
      "id": "node_1749369269529_8276",
      "name": "엔딩: 이상적 엔딩",
      "type": "text",
      "content": "마왕의 방이 붕괴하기 시작했다. 카이렌은 피투성이 몸으로 성 밖으로 걸어나왔다. 그곳엔 자르테와 혼혈의 불꽃 동료들, 그리고—인간 여자가 있었다.\n\n그녀는 달려와 그를 부둥켜안았다.\n\n“정말… 해낸 거예요?”\n\n카이렌은 눈을 감으며 말했다.\n\n“이제부터 시작이야.”\n\n...\n\n수년 후, 인간과 마물이 함께 사는 도시에 ‘불꽃의 왕’이라는 별명이 퍼졌다. 카이렌은 지도자가 아닌 연결자로서, 새로운 시대를 이끌어갔다.\n\n그의 곁에는 언제나 그 여자가 있었다.\n그리고 그들의 아이는, 인간의 눈동자와 마물의 귀를 함께 지닌 채 세상을 웃으며 바라보고 있었다.",
      "x": 4490,
      "y": 1665,
      "next": ""
    }
  ],
  "statusList": []
}